In [1]:
# loc : location
# 이름(label)을 이용해서 원하는 row 선택 -> column 선택

import pandas as pd
df = pd.read_excel('member.xlsx', index_col='번호')
df

     이름  출생연도 출생지  담당파트  체중
번호
1번    진  1992  과천  서브보컬  61
2번    뷔  1995  대구  서브보컬  63
3번   정국  1997  부산  메인보컬  66
4번   슈가  1993  대구  리드래퍼  57
5번  제이홉  1994  광주  메인댄서  59
6번   RM  1994  서울    리더  70
7번   지민  1995  부산  메인댄서  58

In [4]:
df.loc['7번']

이름        지민
출생연도    1995
출생지       부산
담당파트    메인댄서
체중        58
Name: 7번, dtype: object

In [5]:
df.loc['1번', '출생연도']

1992

In [6]:
df.loc[['1번', '2번'], '출생지']

번호
1번    과천
2번    대구
Name: 출생지, dtype: object

In [7]:
# 1번 2번의 출생지와 출생연도
df.loc[['1번', '2번'], ['출생지', '출생연도']]

   출생지  출생연도
번호
1번  과천  1992
2번  대구  1995

In [9]:
# 1번 ~ 4번 이름, 출생연도, 출생지
df.loc['1번':'4번', '이름':'출생지']

    이름  출생연도 출생지
번호
1번   진  1992  과천
2번   뷔  1995  대구
3번  정국  1997  부산
4번  슈가  1993  대구

In [10]:
df.loc['2번':'6번', ['이름', '체중']]

     이름  체중
번호
2번    뷔  63
3번   정국  66
4번   슈가  57
5번  제이홉  59
6번   RM  70

In [12]:
df.loc[['1번', '7번'], ['이름', '담당파트']]

    이름  담당파트
번호
1번   진  서브보컬
7번  지민  메인댄서